# Тип задания 2
## №15124
Логическая функция F задаётся выражением (x ≡ y ) ∨ ((y ∨ z) → x).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.
~~~
print("x y z")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            if not((x == y) or ((y or z) <= x)):
                print(x, y, z)
~~~
В ответе напишите буквы x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). 
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
## №18071
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w.
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
~~~
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not(x and not(y) or (y == z) or not(w)):
                    print(x, y, z, w)
~~~
В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). 
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
## №15939
Логическая функция F задаётся выражением (z ∧ y) ∨ ((x → z ) ≡ (y → w)).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
~~~
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not((z and y) or ((x <= z) == (y <= w))):
                    print(x, y, z, w)
~~~
В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). 
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

# Тип задания 8
## №78064
Все 5⁠-⁠буквенные слова, в составе которых могут быть только буквы К, Р, О, В, А, Т, Ь, записаны в алфавитном порядке и пронумерованы.

Вот начало списка:

1.  ААААА

2.  ААААВ

3.  ААААК

4.  ААААО

5.  ААААР

6.  ААААТ

...

Под каким номером в списке идёт последнее слово c нечётным номером, которое содержит не более одной буквы Т, две буквы В и не содержит букв Ь, стоящих рядом?
~~~
from itertools import product
count = 0
m = []
for p in product(sorted("КРОВАТЬ"), repeat=5):
    count += 1
    s = ''.join(p)
    if count%2 != 0 and ("ЬЬ" not in s) and s.count("В") == 2 and s.count("Т") <= 1:
            m.append(count)
print(max(m))
~~~
## №3570
Все 4-⁠буквенные слова, составленные из букв С, Л, О, Н записаны в алфавитном порядке и пронумерованы.

Вот начало списка:

1.  ЛЛЛЛ

2.  ЛЛЛН

3.  ЛЛЛО

4.  ЛЛЛС

5.  ЛЛНЛ

...

Запишите слово, которое стоит под номером 250.
~~~
a = {0: "Л", 1: "Н", 2: "О", 3: "С"}
k = 0
for i in range(0, len(a)):
    for j in range(0, len(a)):
        for g in range(0, len(a)):
            for m in range(0, len(a)):
                k += 1
                if k == 250:
                    print(a[i], a[j], a[g], a[m], end=" ")
~~~
## №72566 
Определите количество восьмизначных 15-⁠ричных чисел, в записи которых ровно два нуля и не более четырёх цифр, для записи которых используются буквы.
~~~
from itertools import product
count = 0
for i in product ('01a', repeat = 8 ):
    s = ''.join(i)
    if s[0] != '0' and s.count('0') == 2 and s.count('a') <5:
        count += 9**s.count('1') * 5**s.count('a')
print(count)
~~~
