# Задание 1
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом:

Строится двоичная запись числа N. Затем справа дописываются два разряда: символы «01», если число N чётное, и «10», если нечётное.

Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R.
Укажите минимальное число R, большее 130, которое может являться результатом работы этого алгоритма. В ответе это число запишите в десятичной системе.
```
n = int(input())    #Ввод пользователем символов 
r = bin(n)          #Преобразование символов из десятичной системы в двоичную 
print(r)            #Вывод строки в двоичном виде
```
```
n = int(input())    #Ввод пользователем символов 
r = bin(n)[2:]      #Преобразование символов из десятичной системы в двоичную, но уходят первые два числа
print(r)            #Вывод строки в двоичном виде без двух первых символов
```
```
n = int(input())     #Ввод пользователем символов, они натуралы теперь
r = bin(n)[2:]       #Преобразование символов из десятичной системы в двоичную, но уходят первые два числа
print(r)             #Вывод строки в двоичном виде без двух первых символов
if n % 2 == 0:       #Если остаток n равен 0
    r += '01'        #то прибавляет к строке r на конец "01"
else:                #либо
    r += '10'        #прибавляет к строке r на конец "10"
print(r)             #Вывод строки либо '01' либо '10' смотря есть ли остаток или нету 
```
```
for n in range(1, 100):     #Для n в радиусе от 1 до 100 есть числа
    r = bin(n)[2:]          #Преобразование символов из десятичной системы в двоичную, также нету первых двух чисел
    print(r)                #Вывод строки
    if n % 2 == 0:          #Если остаток n равен 0
        r += '01'           #прибавить к строке r "01"
    else:                   #либо
        r += '10'           #прибавить к строке r "10"
    print(n, r)             #Вывод строки r либо '01' либо '10' смотря есть ли остаток или нету, а так же строки n
```
```
for n in range(1, 100):     #Для n в радиусе от 1 до 100
    r = bin(n)[2:]          #Преобразование символов из 10ой системы в 2ую с удалением первых двух символов
    print(r)                #Вывод строки
    if n % 2 == 0:          #Если остаток n равен 0
        r += '01'           #прибавить к строке r "01"
    else:                   #либо
        r += '10'           #прибавить к строке r "10"
    print(n, int(r, 2))     #Вывод строки, r переводит в десятичную систему
```
```
for n in range(1, 100):     #Для n в радиусе от 1 до 100
    r = bin(n)[2:]          #Преобразование символов из десятичной системы в двоичную с удалением первых двух символов в начале
    print(r)                #Вывод строки
    if n % 2 == 0:          #Если остаток n равен 0
        r += '01'           #прибавить к строке r "01"
    else:                   #либо
        r += '10'           #прибавить к строке r "10"
    if int(r, 2) > 130:     #если десятичная r больше 130
        print(int(r, 2))    #Вывод строки, r переводится в десятичную систему
```

# Задание 2
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом:

Строится двоичная запись числа N.
К этой записи дописывается справа бит чётности: 0, если в двоичном коде числа N было чётное число единиц, и 1, если нечётное.
К полученному результату дописывается ещё один бит чётности.

Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R.
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число, большее, чем 184. В ответе это число запишите в десятичной системе.
```
import random                   #Импорт рандомного натурального числа
n = random.randint(1, 100)      #n в рандомной радиусе от 1 до 100
r = bin(n)[2:]                  #Преобразование символов из десятичной системы в двоичную, с удалением первых двух символов
print(n)                        #Вывод строки n
print(r)                        #Вывод строки r
if r.count('1') % 2 == 0:       #Если количество 1 в r при делении на 2 дает остаток 0:
    r += '0'                    #то добавляем к r 0
else:                           #Либо
    r += '1'                    #Добавление к r 1
print(r)                        #Выводим строки r
if r.count('1') % 2 == 0:       #Если количество 1 в r при делении на 2 дает остаток 0
    r += '0'                    #то добавляем к r 0
else:                           #Либо
    r += '1'                    #Добавление к r 1
print(r)                        #Выводим эту строку r
```

# Задание 3
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [126849; 126871], числа, имеющие ровно 4 различных делителя. 
Выведите эти четыре делителя для каждого найденного числа в порядке возрастания
```
for n in range(126849, 126872):     #Для n в радиусе числа от 126849 до 126872
    for i in range (1, n + 1):      #Для i в радиусе от 1 о n+1
        if n % i == 0:              #Если остаток при делении n на i равен 0
           print(i)                 #то выводим его i
```
```
for n in range(126849, 126872):      #Для n в радиусе от 126849 до 126872
    c = 0                            #c равен 0
    for i in range (1, n+1):         #Для i в радиусе от 1 до n+1
        if n % i == 0:               #Если остаток при делении n на i равен 0
           c += 1                    #то прибавляется 1
    print(n, c)                      #Выводим n и c
```
```
for n in range(126849, 126872):       #Для n в радиусе от 126849 до 126872
    c = 0                             #c равен 0
    for i in range (1, n+1):          #Для i в радиусе от 1 о n+1
        if n % i == 0:                #Если остаток при делении n на i равен 0
           c += 1                     #К c прибавляется 1
    if c == 4:                        #Если c равен 4, то
        print(n)                      #Выводим n
```
```
for n in range(126849, 126872):       #Для n в радиусе от 126849 до 126872
    c = set()                         #c равен 0
    for i in range (1, n+1):          #Для i в радиусе от 1 о n+1
        if n % i == 0:                #Если остаток при делении n на i равен 0
           c.add(i)                   #К c прибавляется 1
    if len(c) == 4:                   #Если длина записей в c равно 4, то
        print(*sorted(c))             #Вывести отсортированную c
```
